balazsgrill/modembed/res/Devices/dsPIC33/PIC24HJ128GP510.PIC
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef edc:access="cccccccccccccccc" edc:cname="C1RXFUL2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1RXFUL2" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:AliasList/>
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="RXFUL16" edc:desc="" edc:mask="0x1" edc:name="RXFUL16" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL17" edc:desc="" edc:mask="0x1" edc:name="RXFUL17" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL18" edc:desc="" edc:mask="0x1" edc:name="RXFUL18" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL19" edc:desc="" edc:mask="0x1" edc:name="RXFUL19" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL20" edc:desc="" edc:mask="0x1" edc:name="RXFUL20" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL21" edc:desc="" edc:mask="0x1" edc:name="RXFUL21" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL22" edc:desc="" edc:mask="0x1" edc:name="RXFUL22" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL23" edc:desc="" edc:mask="0x1" edc:name="RXFUL23" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL24" edc:desc="" edc:mask="0x1" edc:name="RXFUL24" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL25" edc:desc="" edc:mask="0x1" edc:name="RXFUL25" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL26" edc:desc="" edc:mask="0x1" edc:name="RXFUL26" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL27" edc:desc="" edc:mask="0x1" edc:name="RXFUL27" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL28" edc:desc="" edc:mask="0x1" edc:name="RXFUL28" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL29" edc:desc="" edc:mask="0x1" edc:name="RXFUL29" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL30" edc:desc="" edc:mask="0x1" edc:name="RXFUL30" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL31" edc:desc="" edc:mask="0x1" edc:name="RXFUL31" edc:nzwidth="0x1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
              <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x400 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1BUFPNT3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1BUFPNT3" edc:nmmrid="0x4" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="F8BP" edc:desc="" edc:mask="0xf" edc:name="F8BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F9BP" edc:desc="" edc:mask="0xf" edc:name="F9BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F10BP" edc:desc="" edc:mask="0xf" edc:name="F10BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F11BP" edc:desc="" edc:mask="0xf" edc:name="F11BP" edc:nzwidth="0x4"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="F8BP0" edc:desc="" edc:mask="0x1" edc:name="F8BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F8BP1" edc:desc="" edc:mask="0x1" edc:name="F8BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F8BP2" edc:desc="" edc:mask="0x1" edc:name="F8BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F8BP3" edc:desc="" edc:mask="0x1" edc:name="F8BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F9BP0" edc:desc="" edc:mask="0x1" edc:name="F9BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F9BP1" edc:desc="" edc:mask="0x1" edc:name="F9BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F9BP2" edc:desc="" edc:mask="0x1" edc:name="F9BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F9BP3" edc:desc="" edc:mask="0x1" edc:name="F9BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F10BP0" edc:desc="" edc:mask="0x1" edc:name="F10BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F10BP1" edc:desc="" edc:mask="0x1" edc:name="F10BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F10BP2" edc:desc="" edc:mask="0x1" edc:name="F10BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F10BP3" edc:desc="" edc:mask="0x1" edc:name="F10BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F11BP0" edc:desc="" edc:mask="0x1" edc:name="F11BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F11BP1" edc:desc="" edc:mask="0x1" edc:name="F11BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F11BP2" edc:desc="" edc:mask="0x1" edc:name="F11BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F11BP3" edc:desc="" edc:mask="0x1" edc:name="F11BP3" edc:nzwidth="1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR/>
        </edc:MuxedSFRDef>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x400 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1BUFPNT4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1BUFPNT4" edc:nmmrid="0x6" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="F12BP" edc:desc="" edc:mask="0xf" edc:name="F12BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F13BP" edc:desc="" edc:mask="0xf" edc:name="F13BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F14BP" edc:desc="" edc:mask="0xf" edc:name="F14BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F15BP" edc:desc="" edc:mask="0xf" edc:name="F15BP" edc:nzwidth="0x4"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="F12BP0" edc:desc="" edc:mask="0x1" edc:name="F12BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F12BP1" edc:desc="" edc:mask="0x1" edc:name="F12BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F12BP2" edc:desc="" edc:mask="0x1" edc:name="F12BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F12BP3" edc:desc="" edc:mask="0x1" edc:name="F12BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F13BP0" edc:desc="" edc:mask="0x1" edc:name="F13BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F13BP1" edc:desc="" edc:mask="0x1" edc:name="F13BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F13BP2" edc:desc="" edc:mask="0x1" edc:name="F13BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F13BP3" edc:desc="" edc:mask="0x1" edc:name="F13BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F14BP0" edc:desc="" edc:mask="0x1" edc:name="F14BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F14BP1" edc:desc="" edc:mask="0x1" edc:name="F14BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F14BP2" edc:desc="" edc:mask="0x1" edc:name="F14BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F14BP3" edc:desc="" edc:mask="0x1" edc:name="F14BP3" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F15BP0" edc:desc="" edc:mask="0x1" edc:name="F15BP0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F15BP1" edc:desc="" edc:mask="0x1" edc:name="F15BP1" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F15BP2" edc:desc="" edc:mask="0x1" edc:name="F15BP2" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="F15BP3" edc:desc="" edc:mask="0x1" edc:name="F15BP3" edc:nzwidth="1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR/>
        </edc:MuxedSFRDef>
        <edc:SFRDef edc:access="cccccccccccccccc" edc:cname="C1RXOVF1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1RXOVF1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXOVF0" edc:desc="" edc:mask="0x1" edc:name="RXOVF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF1" edc:desc="" edc:mask="0x1" edc:name="RXOVF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF2" edc:desc="" edc:mask="0x1" edc:name="RXOVF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF3" edc:desc="" edc:mask="0x1" edc:name="RXOVF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF4" edc:desc="" edc:mask="0x1" edc:name="RXOVF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF5" edc:desc="" edc:mask="0x1" edc:name="RXOVF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF6" edc:desc="" edc:mask="0x1" edc:name="RXOVF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF7" edc:desc="" edc:mask="0x1" edc:name="RXOVF7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF8" edc:desc="" edc:mask="0x1" edc:name="RXOVF8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF9" edc:desc="" edc:mask="0x1" edc:name="RXOVF9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF10" edc:desc="" edc:mask="0x1" edc:name="RXOVF10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF11" edc:desc="" edc:mask="0x1" edc:name="RXOVF11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF12" edc:desc="" edc:mask="0x1" edc:name="RXOVF12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF13" edc:desc="" edc:mask="0x1" edc:name="RXOVF13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF14" edc:desc="" edc:mask="0x1" edc:name="RXOVF14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF15" edc:desc="" edc:mask="0x1" edc:name="RXOVF15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="cccccccccccccccc" edc:cname="C1RXOVF2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1RXOVF2" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXOVF16" edc:desc="" edc:mask="0x1" edc:name="RXOVF16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF17" edc:desc="" edc:mask="0x1" edc:name="RXOVF17" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF18" edc:desc="" edc:mask="0x1" edc:name="RXOVF18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF19" edc:desc="" edc:mask="0x1" edc:name="RXOVF19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF20" edc:desc="" edc:mask="0x1" edc:name="RXOVF20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF21" edc:desc="" edc:mask="0x1" edc:name="RXOVF21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF22" edc:desc="" edc:mask="0x1" edc:name="RXOVF22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF23" edc:desc="" edc:mask="0x1" edc:name="RXOVF23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF24" edc:desc="" edc:mask="0x1" edc:name="RXOVF24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF25" edc:desc="" edc:mask="0x1" edc:name="RXOVF25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF26" edc:desc="" edc:mask="0x1" edc:name="RXOVF26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF27" edc:desc="" edc:mask="0x1" edc:name="RXOVF27" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF28" edc:desc="" edc:mask="0x1" edc:name="RXOVF28" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF29" edc:desc="" edc:mask="0x1" edc:name="RXOVF29" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF30" edc:desc="" edc:mask="0x1" edc:name="RXOVF30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOVF31" edc:desc="" edc:mask="0x1" edc:name="RXOVF31" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x400 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnn-n-nn" edc:cname="C1RXM0SID" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxx0x0xx" edc:name="C1RXM0SID" edc:nmmrid="0x8" edc:nzwidth="0x10" edc:por="xxxxxxxxxxx0x0xx">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
                  <edc:AdjustPoint edc:offset="1"/>
                  <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
                  <edc:AdjustPoint edc:offset="1"/>
                  <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3" edc:name="EID" edc:nzwidth="2"/>
                  <edc:AdjustPoint edc:offset="3"/>
                  <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="11"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef edc:access="nrrrnnnnnrrrnnnn" edc:cname="C1TR01CON" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1TR01CON" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:AliasList/>
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="TX0PRI" edc:desc="" edc:mask="0x3" edc:name="TX0PRI" edc:nzwidth="0x2"/>
                  <edc:SFRFieldDef edc:cname="RTREN0" edc:desc="" edc:mask="0x1" edc:name="RTREN0" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXREQ0" edc:desc="" edc:mask="0x1" edc:name="TXREQ0" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXERR0" edc:desc="" edc:mask="0x1" edc:name="TXERR0" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXLARB0" edc:desc="" edc:mask="0x1" edc:name="TXLARB0" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXABT0" edc:desc="" edc:mask="0x1" edc:name="TXABT0" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXEN0" edc:desc="" edc:mask="0x1" edc:name="TXEN0" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TX1PRI" edc:desc="" edc:mask="0x3" edc:name="TX1PRI" edc:nzwidth="0x2"/>
                  <edc:SFRFieldDef edc:cname="RTREN1" edc:desc="" edc:mask="0x1" edc:name="RTREN1" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXREQ1" edc:desc="" edc:mask="0x1" edc:name="TXREQ1" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXERR1" edc:desc="" edc:mask="0x1" edc:name="TXERR1" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXLARB1" edc:desc="" edc:mask="0x1" edc:name="TXLARB1" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXABT1" edc:desc="" edc:mask="0x1" edc:name="TXABT1" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="TXEN1" edc:desc="" edc:mask="0x1" edc:name="TXEN1" edc:nzwidth="0x1"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="TX0PRI0" edc:desc="" edc:mask="0x1" edc:name="TX0PRI0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="TX0PRI1" edc:desc="" edc:mask="0x1" edc:name="TX0PRI1" edc:nzwidth="1"/>
                  <edc:AdjustPoint edc:offset="6"/>
                  <edc:SFRFieldDef edc:cname="TX1PRI0" edc:desc="" edc:mask="0x1" edc:name="TX1PRI0" edc:nzwidth="1"/>
                  <edc:SFRFieldDef edc:cname="TX1PRI1" edc:desc="" edc:mask="0x1" edc:name="TX1PRI1" edc:nzwidth="1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
              <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x400 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1RXM0EID" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="C1RXM0EID" edc:nmmrid="0xa" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
                </edc:SFRMode>
                <edc:SFRMode edc:id="LT.0">
                  <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xffff" edc:name="EID" edc:nzwidth="16"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
